Table of Contents
 Enum IdeaBeamSegmentEndFlags
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public enum IdeaBeamSegmentEndFlags
Fields
AllDirActive = 0
Free end, fully loaded
DoNotActDirX = 1
DoNotActDirY = 2
Loaded in XZ, internal forces Vy, Mx, Mz are not allowed, fixed at Y, rz
DoNotActDirZ = 4
Loaded in XY, internal forces Vz, Mx, My are not allowed, fixed at Z, ry
NoBending = 32
No bending moments
Rod = 16
Only axial force
Supported = 8
End is fully supported
Fields
 Name |  Description
 AllDirActive = 0
Free end, fully loaded
 DoNotActDirX = 1
 DoNotActDirY = 2
Loaded in XZ, internal forces Vy, Mx, Mz are not allowed, fixed at Y, rz
 DoNotActDirZ = 4
Loaded in XY, internal forces Vz, Mx, My are not allowed, fixed at Z, ry
 NoBending = 32
No bending moments
 Rod = 16
Only axial force
 Supported = 8
End is fully supported
 Edit this page